src/cf/Catalogs/уатМаршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатМаршруты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеМаршрутаОднимПунктом</Name>
					<Comment>Ложь-пары пунктов, Истина-один пункт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Расстояние</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПланированияВАРМЛогиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУсловияРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСтатусыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветНаКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НочнойМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
					<Comment>Этапы движения по маршруту</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяВПути</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Comment>Пункт отправления</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктПрибытия</Name>
							<Comment>Пункт прибытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Comment>Расстояние</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочкиМаршрута</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/уатРасписаниеРейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатРасписаниеРейсов</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пн</Name>
					<Comment>Понедельник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вт</Name>
					<Comment>Вторник</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ср</Name>
					<Comment>Среда</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чт</Name>
					<Comment>Четверг</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пт</Name>
					<Comment>Пятница</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сб</Name>
					<Comment>Суббота</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вс</Name>
					<Comment>Воскресенье</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейДоОтправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВремяПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяУбытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВыходыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатРейсыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИДПункта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПунктНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыТочекМаршрута</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяПогрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительнаяРазгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатМаршруты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем IDзадачиВнешнийМаршрутизатор;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Объект, ЭтотОбъект, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.уатМаршруты) Тогда 
		Элементы.ПредставлениеМаршрута.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		МодульЭлектронныеКартыСервер = ОбщегоНазначения.ОбщийМодуль("уатЭлектронныеКартыСервер");
		МодульЭлектронныеКартыСервер.УстановитьСписокВыбораЦветовВПоле(Элементы.ЦветНаКарте);
		Если Объект.Ссылка.Пустая() Тогда
			УстановитьСлучайныйЦветПункта();
		КонецЕсли;
	КонецЕсли;

	// уатУправлениеАвтотранспортом.МодификацияКонфигурации
	уатМодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации
	
	Элементы.ГруппаСтатус.Видимость = Объект.Статус = Перечисления.уатСтатусыдействия.НеДействует;
	
	ВосстановитьНастройки();
	ЗаполнитьРасписаниеРейсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьДоступность();
	
	Если Объект.ПредставлениеМаршрутаОднимПунктом Тогда 
		ПредставлениеМаршрута = 1;
	Иначе 
		ПредставлениеМаршрута = 2;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "ЭлектронныеКарты_ЗаписьМаршрута"
		И Источник = Объект.Ссылка Тогда
		Модифицированность = Истина;
		Прочитать();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьРасписаниеРейсов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Расстояние = 0 И Объект.ВремяВПути = 0 Тогда
		ПриИзмененииПункта();
		ОбновитьРасстояние();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеМаршрутаПриИзменении(Элемент)
	
	Если ПредставлениеМаршрута = 1 Тогда 
		Объект.ПредставлениеМаршрутаОднимПунктом = Истина;
	Иначе 
		Объект.ПредставлениеМаршрутаОднимПунктом = Ложь;
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
			Объект.ИспользоватьДляПланированияВАРМЛогиста = Ложь;
			Объект.НочнойМаршрут = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяВПутиПриИзменении(Элемент)
	
	уатЗащищенныеФункцииСервер.КонтрольВводаВремени(Объект.ВремяВПути);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОтправленияПриИзменении(Элемент)
	
	уатЗащищенныеФункцииСервер.КонтрольВводаВремени(Объект.ВремяОтправления);
	
	Если Объект.ВремяОтправления > 23.59 Тогда
		Объект.ВремяОтправления = 23 + (Объект.ВремяОтправления - Цел(Объект.ВремяОтправления));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДляПланированияВАРМЛогистаПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Элементы.ГруппаСтатус.Видимость = Объект.Статус = ПредопределенноеЗначение("Перечисление.уатСтатусыдействия.НеДействует");
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРейсовТолькоДействующиеПриИзменении(Элемент)
	ЗаполнитьРасписаниеРейсов();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПунктыСледования

&НаКлиенте
Процедура ПунктыСледованияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.ПунктыСледования.ТекущиеДанные.УИД = СформироватьУИД();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыСледованияПередУдалением(Элемент, Отказ)
	
	// уатУправлениеАвтотранспортом.МодификацияКонфигурации
	уатМодификацияКонфигурацииКлиентПереопределяемый.ПолеТаблицыФормыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	// Конец уатУправлениеАвтотранспортом.МодификацияКонфигурации
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыСледованияПослеУдаления(Элемент)
	
	ОбновитьРасстояние();
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктыСледованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьРасстояние();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПунктОтправленияПриИзменении(Элемент)
	
	ПриИзмененииПункта();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПунктПрибытияПриИзменении(Элемент)
	
	ПриИзмененииПункта();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыВремяВПутиПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ПунктыСледования.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	уатЗащищенныеФункцииСервер.КонтрольВводаВремени(ТекСтрока.ВремяВПути);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьВремяРасстояние(Команда)
	
	ПриИзмененииПункта();
	ОбновитьРасстояние();
	Если Объект.ВремяВПути = 0 И Объект.Расстояние = 0 Тогда 
		ТекстНСТР = НСтр("en='Failed to calculate the time and distance between points.';ru='Не удалось рассчитать время и расстояние между пунктами.'");
		ПоказатьПредупреждение(, ТекстНСТР);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРейсовНастроить(Команда)
	ПараметрыФормы = Новый Структура("Маршрут", Объект.Ссылка);
	ОткрытьФорму("Обработка.уатРасписаниеМаршрутов.Форма.Форма", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеРейсовОбновить(Команда)
	ЗаполнитьРасписаниеРейсов();
КонецПроцедуры

&НаКлиенте
Процедура ОптимальноеПерестроениеМаршрута(Команда)
	
	// Проверка корректности маршрута. Первая точка должна быть погрузкой, остальные - разгрузкой.
	ТекстОшибки = "";
	Если Не Объект.ПредставлениеМаршрутаОднимПунктом Тогда
		ТекстОшибки = НСтр("ru = 'Для оптимального перестроения маршрут должен быть представлен одиночными пунктами'; en = 'For optimal rebuilding, the route should be represented by single points'");
	ИначеЕсли Объект.Этапы.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Для оптимального перестроения требуется заполнить маршрут'; en = 'For optimal rebuilding, the route must be filled in'");
	ИначеЕсли Объект.Этапы[0].ТипТочкиМаршрута <> ПредопределенноеЗначение("Перечисление.уатТипыТочекМаршрута.Погрузка") Тогда
		ТекстОшибки = НСтр("ru = 'Для оптимального перестроения первая точка маршрута должна быть точкой погрузки'; en = 'For optimal rebuilding, the first route point should be a loading point'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Для Сч = 1 По Объект.Этапы.Количество() - 1 Цикл
			Если Объект.Этапы[Сч].ТипТочкиМаршрута <> ПредопределенноеЗначение("Перечисление.уатТипыТочекМаршрута.Разгрузка") Тогда
				ТекстОшибки = НСтр("ru = 'Для оптимального перестроения все точки маршрута после первой должны быть точками разгрузки'; en = 'For optimal rebuilding, all route points after the first must be unloading points'");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	НастройкиМаршрутизации = уатОбщегоНазначения_уэ.ПолучитьНастройкиМаршрутизацииДляОптимизацииМаршрута();
	флRarusVRP = НастройкиМаршрутизации.НастройкаАлгоритмОптимизации = "RarusVRP";
	ТекстОшибки = "";
	
	Если НастройкиМаршрутизации.НастройкаАлгоритмОптимизации = "Яндекс"
		Или НастройкиМаршрутизации.НастройкаАлгоритмОптимизации = "RarusVRP" Тогда
		// Яндекс
		IDЗадачиВнешнийМаршрутизатор = ВнешняяМаршрутизация_ДобавитьЗадачуSVRP(НастройкиМаршрутизации, ТекстОшибки);
		Если Не ЗначениеЗаполнено(IDЗадачиВнешнийМаршрутизатор) Тогда 
			ПоказатьПредупреждение(, ТекстОшибки);
			Возврат;
		КонецЕсли;
		
		УстановитьАдресХранилищаДляРезультатаМаршрутизации();
		
		ДлительнаяОперация = ОптимальноеПерестроениеМаршрутаПараметрыВыполненияВФоне(АдресХранилищаДО, IDЗадачиВнешнийМаршрутизатор, флRarusVRP);
		
		НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		НастройкиОжидания.ВыводитьОкноОжидания       = Истина;
		НастройкиОжидания.ВыводитьПрогрессВыполнения = Истина;
		
		Обработчик = Новый ОписаниеОповещения("ОптимальноеПерестроениеМаршрутаДлительнаяОперацияЗавершение", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, НастройкиОжидания);
	Иначе
		// Алгоритм очередей
		АдресаПунктов = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Этапы Цикл
			АдресаПунктов.Добавить(ТекСтрока.ПунктОтправления);
		КонецЦикла;
		ДополнительныеПараметры = Новый Структура("НастройкиМаршрутизации, АдресаПунктов", НастройкиМаршрутизации, АдресаПунктов);
		Если Не уатЗащищенныеФункцииСервер_уэ.ВремяРасстояниеМеждуПунктамиЗаполнено(АдресаПунктов) Тогда
			
			ТекстВопроса = Новый ФорматированнаяСтрока(
				НСтр("en='To continue routing it is necessary to update the distances between the points.';ru='Для продолжения маршрутизации необходимо выполнить обновление расстояний между пунктами.'") + Символы.ПС
				+ НСтр("en='For update it is necessary to have access to the server';ru='Для обновления необходимо наличие доступа к серверу'") + " "
				+ НСтр("en='via the Internet. Operation can take a long time.';ru='через интернет. Операция может занять длительное время.'") + Символы.ПС
				+ НСтр("en='Duration depends on the number of destinations in route.';ru='Продолжительность зависит от количества пунктов назначения в маршруте.'") + Символы.ПС
				+ НСтр("en='Maximum number of requests to online service is limited.';ru='Максимальное количество запросов к онлайн сервису ограничено.'")
			);
			
			Оповещение = Новый ОписаниеОповещения("ОптимальноеПерестроениеМаршрутаОбновитьПункты", ЭтотОбъект, ДополнительныеПараметры);
			СписокОтветов = Новый СписокЗначений();
			СписокОтветов.Добавить("ОбновитьПункты",          НСтр("en='Update distances';ru='Обновить расстояния'"));
			СписокОтветов.Добавить("ПродолжитьБезОбновления", НСтр("en='Continue without updating';ru='Продолжить без обновления'"));
			СписокОтветов.Добавить("Отменить",                НСтр("en='Cancel routing';ru='Отменить маршрутизацию'"));
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокОтветов);
		Иначе 
			ОптимальноеПерестроениеМаршрутаПослеОбновленияПунктов(Неопределено, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбновитьРасстояние()
	
	мРасстояние = Объект.Этапы.Итог("Расстояние");
	Если Объект.Расстояние <> мРасстояние Тогда
		Объект.Расстояние = мРасстояние;
	КонецЕсли;
	
	мВремяВПути = 0;
	Для Каждого ТекСтрока Из Объект.Этапы цикл
		Если ЗначениеЗаполнено(ТекСтрока.ВремяВПути) Тогда
			мВремяВПути = уатЗащищенныеФункцииСервер.СложитьВремя(мВремяВПути, ТекСтрока.ВремяВПути);
		КонецЕсли;
	КонецЦикла;
	Если Объект.ВремяВПути <> мВремяВПути Тогда
		Объект.ВремяВПути = мВремяВПути;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьРасстояние()

&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Если Объект.ПредставлениеМаршрутаОднимПунктом Тогда
		Элементы.ПунктыСледования.ПодчиненныеЭлементы.ЭтапыПунктПрибытия.Видимость    = Ложь;
		Элементы.ПунктыСледования.ПодчиненныеЭлементы.ЭтапыПунктОтправления.Заголовок = НСтр("en='Point';ru='Пункт'");
		Элементы.ПунктыСледования.ПодчиненныеЭлементы.ПунктыСледованияКонтрагент.Видимость = Истина;
		
	Иначе
		Элементы.ПунктыСледования.ПодчиненныеЭлементы.ЭтапыПунктПрибытия.Видимость    = Истина;
		Элементы.ПунктыСледования.ПодчиненныеЭлементы.ЭтапыПунктОтправления.Заголовок = НСтр("en='Point of departure';ru='Пункт отправления'");
		Элементы.ПунктыСледования.ПодчиненныеЭлементы.ПунктыСледованияКонтрагент.Видимость = Ложь;
	КонецЕсли;
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Элементы.ЭтапыОперация.Видимость            = Ложь;
		Элементы.ВремяОтправления.Видимость         = Ложь;
		Элементы.СтраницаТС.Видимость               = Ложь;
		Элементы.СтраницаРасписаниеРейсов.Видимость = Ложь;
		Элементы.ЦветНаКарте.Видимость              = Ложь;
	Иначе
		Элементы.СтраницаРасписаниеРейсов.Видимость = Истина;
		Элементы.ЦветНаКарте.Видимость              = Истина;
		
		Элементы.ИспользоватьДляПланированияВАРМЛогиста.Доступность = Объект.ПредставлениеМаршрутаОднимПунктом;
		
		Если Объект.ПредставлениеМаршрутаОднимПунктом Тогда 
			Элементы.ЭтапыОперация.Видимость = Истина;
		Иначе 
			Элементы.ЭтапыОперация.Видимость = Ложь;
		КонецЕсли;
		
		Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ() И Объект.ИспользоватьДляПланированияВАРМЛогиста Тогда
			Элементы.ВремяОтправления.Видимость = Истина;
			Элементы.СтраницаТС.Видимость       = Истина;
			Элементы.НочнойМаршрут.Видимость    = Истина;
		Иначе 
			Элементы.ВремяОтправления.Видимость = Ложь;
			Элементы.СтраницаТС.Видимость       = Ложь;
			Элементы.НочнойМаршрут.Видимость    = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ИспользоватьДляПланированияВАРМЛогиста.Видимость = уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП();
	
	// Сейчас контрагент не используется для заполнения в документах, 
	// используется только для маршрутизации по алгоритму фиксированных маршрутов.
	// Отображения для варианта "Парные пункты" оставлено, чтобы не потерять данные пользователей.
	Элементы.ПунктыСледованияКонтрагент.Видимость = НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ();
	
	Элементы.ОптимальноеПерестроениеМаршрута.Видимость = НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиПРОФ() И Объект.ПредставлениеМаршрутаОднимПунктом;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПункта()
	
	Для Сч = 0 По Объект.Этапы.Количество() - 1 Цикл 
		Пункт1 = Объект.Этапы[Сч].ПунктОтправления;
		
		Если Объект.ПредставлениеМаршрутаОднимПунктом Тогда
			Если Сч = Объект.Этапы.Количество() - 1 Тогда 
				Объект.Этапы[Сч].Расстояние = 0;
				Объект.Этапы[Сч].ВремяВПути = 0;
				Продолжить;
			Иначе 
				Пункт2 = Объект.Этапы[Сч+1].ПунктОтправления;
			КонецЕсли;
		Иначе
			Пункт2 = Объект.Этапы[Сч].ПунктПрибытия;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Пункт1) Или Не ЗначениеЗаполнено(Пункт2) Тогда
			Продолжить;
		КонецЕсли;
		
		мсвПункты = Новый Массив;
		мсвПункты.Добавить(Новый Структура("Пункт1, Пункт2", Пункт1, Пункт2));
		
		уатЗащищенныеФункцииСервер.РассчитатьТаблицуРасстояниеВремяМеждуПунктами(мсвПункты);
		
		Объект.Этапы[Сч].Расстояние = мсвПункты[0].Расстояние;
		Объект.Этапы[Сч].ВремяВПути = мсвПункты[0].Время;
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает новый УИД для таблицы этапов.
// Новый УИД = Количество этапов + 1.
//
// Возвращаемое значение:
//	Число - номер нового этапа маршрута.
//
&НаСервере
Функция СформироватьУИД()
	
	мТаблица = Объект.Этапы.Выгрузить();
	мТаблица.Сортировать("УИД Возр");
	мКоличество = мТаблица.Количество();
	Если мКоличество > 0 Тогда
		мУИД = мТаблица[мКоличество-1].УИД + 1;
	Иначе
		мУИД = 1;
	КонецЕсли;
	
	Возврат мУИД;
	
КонецФункции //СформироватьУИД

&НаСервере
Процедура УстановитьСлучайныйЦветПункта()
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Возврат;
	КонецЕсли;
	
	МодульЗащищенныеФункцииСервер_проф = ОбщегоНазначения.ОбщийМодуль("уатЗащищенныеФункцииСервер_проф");
	Объект.ЦветНаКарте = МодульЗащищенныеФункцииСервер_проф.СлучайноеЧисло(, 15);
	
	Если Объект.ЦветНаКарте = 0 Тогда 
		Объект.ЦветНаКарте = 16;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасписаниеРейсов()
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Возврат;
	КонецЕсли;
	
	РасписаниеРейсов.Очистить();
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатРасписаниеРейсов.Выход КАК Выход,
		|	уатРасписаниеРейсов.Рейс КАК Рейс,
		|	уатРасписаниеРейсов.ДействуетС КАК ДействуетС,
		|	уатРасписаниеРейсов.ДействуетПо КАК ДействуетПо,
		|	уатРасписаниеРейсов.Пн КАК Пн,
		|	уатРасписаниеРейсов.Вт КАК Вт,
		|	уатРасписаниеРейсов.Ср КАК Ср,
		|	уатРасписаниеРейсов.Чт КАК Чт,
		|	уатРасписаниеРейсов.Пт КАК Пт,
		|	уатРасписаниеРейсов.Сб КАК Сб,
		|	уатРасписаниеРейсов.Вс КАК Вс,
		|	уатРасписаниеРейсов.ДнейДоОтправления КАК ДнейДоОтправления,
		|	уатРасписаниеРейсов.ДнейВПути КАК ДнейВПути,
		|	уатРасписаниеРейсов.FTL КАК FTL,
		|	уатРасписаниеРейсов.ВремяПрибытия КАК ВремяПрибытия,
		|	уатРасписаниеРейсов.ВремяУбытия КАК ВремяОтправления,
		|	ЕСТЬNULL(уатМаршрутыЭтапы.ПунктОтправления, ЗНАЧЕНИЕ(Справочник.уатПунктыНазначения.ПустаяСсылка)) КАК Пункт
		|ИЗ
		|	РегистрСведений.уатРасписаниеРейсов КАК уатРасписаниеРейсов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.уатМаршруты.Этапы КАК уатМаршрутыЭтапы
		|		ПО уатРасписаниеРейсов.Маршрут = уатМаршрутыЭтапы.Ссылка
		|			И уатРасписаниеРейсов.УИДПункта = уатМаршрутыЭтапы.УИД
		|ГДЕ
		|	уатРасписаниеРейсов.Маршрут = &Маршрут";
		Если РасписаниеРейсовТолькоДействующие Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И (уатРасписаниеРейсов.ДействуетС = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ уатРасписаниеРейсов.ДействуетС <= &ТекущаяДата)
			|	И (уатРасписаниеРейсов.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ уатРасписаниеРейсов.ДействуетПо >= &ТекущаяДата)";
			Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + "
		|УПОРЯДОЧИТЬ ПО
		|	уатРасписаниеРейсов.Рейс,
		|	уатРасписаниеРейсов.ДатаУстановки,
		|	уатРасписаниеРейсов.ДействуетС,
		|	уатРасписаниеРейсов.ДействуетПо,
		|	уатМаршрутыЭтапы.НомерСтроки";
		Запрос.УстановитьПараметр("Маршрут", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = РасписаниеРейсов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		ПрочиеНастройки = ХранилищеНастроекДанныхФорм.Загрузить(
			"Справочник.уатМаршруты.Форма.ОсновнаяФорма",
			"уатМаршруты_Настройки"
		);
		Если ТипЗнч(ПрочиеНастройки) = Тип("Структура") 
			И ПрочиеНастройки.Свойство("РасписаниеРейсовТолькоДействующие") Тогда
			РасписаниеРейсовТолькоДействующие = ПрочиеНастройки.РасписаниеРейсовТолькоДействующие;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПрочиеНастройки = Новый Структура("РасписаниеРейсовТолькоДействующие", РасписаниеРейсовТолькоДействующие);
	ХранилищеНастроекДанныхФорм.Сохранить(
		"Справочник.уатМаршруты.Форма.ОсновнаяФорма", 
		"уатМаршруты_Настройки", 
		ПрочиеНастройки
	);
	
КонецПроцедуры

#Область ОптимальноеПерестроениеМаршрута

&НаСервере
Функция ВнешняяМаршрутизация_ДобавитьЗадачуSVRP(НастройкиМаршрутизации, ТекстОшибки)
	
	Грузоподъемность = 0;
	ОбъемКузова = 0;
	ТипТС = Неопределено;
	РежимОптимизацииМаршрута = Истина;
	ВозвратВГараж = Ложь;
	МассивПунктовРазгрузки = Новый Массив;
	ПунктОтправления = Неопределено;
	ТекстОшибки      = "";
	
	ДатаПланирования = НачалоДня(ТекущаяДатаСеанса());
	Сч = 0;
	Для Каждого ТекСтрока Из Объект.Этапы Цикл
		Если Сч = 0 Тогда
			ПунктОтправления = ТекСтрока.ПунктОтправления;
		Иначе 
			МассивПунктовРазгрузки.Добавить(Новый Структура("Ссылка, GUID", ТекСтрока.ПунктОтправления, ТекСтрока.ПунктОтправления.Наименование));
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;
	
	ДанныеПоЗаказам = Новый Структура(
		"МассивПромежуточныхТочек, СтрокиЗаказаВДокументе, Гараж, ЗаездНаСкладПриВозврате, УчитыватьГаражВозвращения, ГаражВозвращения, ДатаВыезда, КоличествоЗаказов",
		МассивПунктовРазгрузки,
		Новый Соответствие(),
		ПунктОтправления,
		Ложь,
		Ложь,
		Неопределено,
		НачалоДня(ТекущаяДатаСеанса()),
		0
	);
	ХарактеристикиСцепки = Новый Структура("ТС,Грузоподъемность,ОбъемКузова", Неопределено, Грузоподъемность, ОбъемКузова);
	МодульВнешнейМаршрутизации = ОбщегоНазначения.ОбщийМодуль("уатВнешнийМаршрутизаторСервер_уэ");
	Возврат МодульВнешнейМаршрутизации.Маршрутизация_ДобавитьЗадачуSVRP(
		НачалоДня(ТекущаяДатаСеанса()),
		ХарактеристикиСцепки, 
		ДанныеПоЗаказам,
		НастройкиМаршрутизации,
		ТекстОшибки,
		Истина
	);
	
КонецФункции

&НаСервере
Процедура УстановитьАдресХранилищаДляРезультатаМаршрутизации()
	
	АдресХранилищаДО = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте 
Процедура ОптимальноеПерестроениеМаршрутаДлительнаяОперацияЗавершение(Операция, ДополнительныеПараметры) Экспорт
	
	Если Операция = Неопределено Тогда
		
	Иначе
		Если Операция.Статус = "Выполнено" Тогда
			Если ЭтоАдресВременногоХранилища(Операция.АдресРезультата) Тогда
				Данные = ПолучитьИзВременногоХранилища(Операция.АдресРезультата);
				Если ТипЗнч(Данные) = Тип("Структура") Тогда
					Если Данные.Свойство("ТекстОшибки") Тогда
						Если ЗначениеЗаполнено(Данные.ТекстОшибки) Тогда
							ПоказатьПредупреждение(, Данные.ТекстОшибки);
							Возврат;
						Иначе
							ОптимальноеПерестроениеМаршрутаПослеМаршрутизации(Неопределено, Неопределено);
						КонецЕсли;
					КонецЕсли;
					IDзадачиВнешнийМаршрутизатор = Неопределено;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВызватьИсключение Операция.КраткоеПредставлениеОшибки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ОптимальноеПерестроениеМаршрутаПослеМаршрутизации(Результат, ДопПараметры)
	ТекстПредупреждения = "";
	ВыполнитьРаспределениеСервер(ДопПараметры, ТекстПредупреждения);
	ОбновитьРасстояние();
	Модифицированность = Истина;
	ТекстПредупреждения = Новый ФорматированнаяСтрока(ТекстПредупреждения 
	+ Символы.ПС,
	?(ЗначениеЗаполнено(IDзадачиВнешнийМаршрутизатор),НСтр("ru = 'ID задачи: '; en = 'Task ID: '") + IDЗадачиВнешнийМаршрутизатор, ""),
	Символы.ПС,
	?(ЗначениеЗаполнено(IDзадачиВнешнийМаршрутизатор) И НЕ флRarusVRP,
	Новый ФорматированнаяСтрока(НСтр("ru = 'Открыть в браузере'; en = 'Open in browser'"),,,, "https://courier.yandex.ru/mvrp-map#" + IDзадачиВнешнийМаршрутизатор), ""));
	ПоказатьПредупреждение(, ТекстПредупреждения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРаспределениеСервер(ДопПараметры, ТекстПредупреждения)
	
	РаспредЗаказов = ПолучитьИзВременногоХранилища(АдресХранилищаДО);
	флRarusVRP = РаспредЗаказов.Свойство("флRarusVRP") И РаспредЗаказов.флRarusVRP;
	
	Если РаспредЗаказов = Неопределено Или Не ТипЗнч(РаспредЗаказов) = Тип("Структура") Или Не РаспредЗаказов.Свойство("пул") Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаЭтапыНовая = Объект.Этапы.Выгрузить(Новый Массив);
	
	СтрокаНовогоМаршрута = ТаблицаЭтапыНовая.Добавить();
	СтрокаНовогоМаршрута.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Погрузка;
	СтрокаНовогоМаршрута.ВремяВПути       = РаспредЗаказов.пул.ВремяВПутиОтГаража;
	СтрокаНовогоМаршрута.Расстояние       = РаспредЗаказов.пул.РасстояниеОтГаража;
	СтрокаНовогоМаршрута.УИД              = Объект.Этапы[0].УИД;
	СтрокаНовогоМаршрута.ПунктОтправления = Объект.Этапы[0].ПунктОтправления;
	
	Для Каждого ТекСтрока Из РаспредЗаказов.пул.Маршрут Цикл
		Если ТекСтрока.Свойство("Тип") И ТекСтрока.Тип = "depot" Тогда
			// Депо уже добавлено перед циклом
			Продолжить;
		КонецЕсли;
		
		СтрокаНовогоМаршрута = ТаблицаЭтапыНовая.Добавить();
		СтрокаНовогоМаршрута.ТипТочкиМаршрута = Перечисления.уатТипыТочекМаршрута.Разгрузка;
		СтрокаНовогоМаршрута.ВремяВПути = ТекСтрока.ВремяВПути;
		СтрокаНовогоМаршрута.Расстояние = ТекСтрока.Расстояние;
		
		Для Каждого ТекЭтапСтарый Из Объект.Этапы Цикл
			Если ТипЗнч(ТекСтрока.Заказ) = Тип("СправочникСсылка.уатПунктыНазначения")
				И ТекЭтапСтарый.ПунктОтправления = ТекСтрока.Заказ Тогда
				СтрокаНовогоМаршрута.ПунктОтправления = ТекЭтапСтарый.ПунктОтправления;
				СтрокаНовогоМаршрута.УИД              = ТекЭтапСтарый.УИД;
				Прервать;
			ИначеЕсли Строка(ТекЭтапСтарый.ПунктОтправления) = ТекСтрока.Заказ Тогда
				// Поиск пункта по строковому представлению
				СтрокаНовогоМаршрута.ПунктОтправления = ТекЭтапСтарый.ПунктОтправления;
				СтрокаНовогоМаршрута.УИД              = ТекЭтапСтарый.УИД;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЗначениеЗаполнено(СтрокаНовогоМаршрута.ПунктОтправления) Тогда
			ТекстПредупреждения = НСтр("ru = 'Ошибка при оптимизации маршрута. "
"В маршруте не найден переданный из маршрутизатора пункт %1'; en = 'Route optimization error."
"The route was not found for the route item %1 sent from the router.'");
			ТекстПредупреждения = СтрШаблон(ТекстПредупреждения, ТекСтрока.Заказ);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	НераспределенныеПункты = Новый Массив();
	Для Каждого ТекЭтапСтарый Из Объект.Этапы Цикл 
		флПерераспределен = Ложь;
		Для Каждого ТекЭтапНовый Из ТаблицаЭтапыНовая Цикл
			Если ТекЭтапСтарый.ПунктОтправления = ТекЭтапНовый.ПунктОтправления Тогда
				флПерераспределен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не флПерераспределен Тогда 
			НераспределенныеПункты.Добавить(ТекЭтапСтарый.ПунктОтправления);
		КонецЕсли;
	КонецЦикла;
	
	Если НераспределенныеПункты.Количество() Тогда 
		ТекстПредупреждения = НСтр("en='Ordering of points is completed.';ru='Оптимизация маршрута завершена.'");
		
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + НСтр("en='Failed to allocate the following points:';ru='Не удалось распределить следующие пункты:'");
		
		Для Каждого ТекПункт Из НераспределенныеПункты Цикл 
			ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + Строка(ТекПункт);
		КонецЦикла;
		
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + НСтр("en='These points added to the end of route.';ru='Указанные пункты были отброшены.'");
		
		Если флRarusVRP Тогда
			ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + НСтр("en='Possibly, service failed to create a route to these points.';
				|ru='Возможно, сервер маршрутизации не смог построить маршрут до этих пунктов.'");
		КонецЕсли;
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Оптимизация маршрута выполнена успешно'; en = 'Route optimization completed successfully'");
	КонецЕсли;
	
	Объект.Этапы.Загрузить(ТаблицаЭтапыНовая);
	
КонецПроцедуры

&НаКлиенте
Процедура ОптимальноеПерестроениеМаршрутаОбновитьПункты(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = "ОбновитьПункты" Тогда 
		уатЗащищенныеФункцииСервер_уэ.ОбновитьВремяРасстояниеМеждуПунктами(, ДополнительныеПараметры.АдресаПунктов);
		ОптимальноеПерестроениеМаршрутаПослеОбновленияПунктов(Неопределено, ДополнительныеПараметры);
		
	ИначеЕсли РезультатВопроса = "ПродолжитьБезОбновления" Тогда 
		ОптимальноеПерестроениеМаршрутаПослеОбновленияПунктов(Неопределено, ДополнительныеПараметры);
		
	Иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОптимальноеПерестроениеМаршрутаПослеОбновленияПунктов(Результат, ДопПараметры)
	
	УстановитьАдресХранилищаДляРезультатаМаршрутизации();
	уатЗащищенныеФункцииСервер_уэ.ОптимальноеПерестроениеМаршрута(
		АдресХранилищаДО, ДопПараметры.АдресаПунктов, Объект.Этапы[0].ПунктОтправления);
	ОптимальноеПерестроениеМаршрутаПослеМаршрутизации(Неопределено, ДопПараметры);
	
КонецПроцедуры

&НаСервере
Функция ОптимальноеПерестроениеМаршрутаПараметрыВыполненияВФоне(АдресХранилищаДО, IDЗадачиВнешнийМаршрутизатор, флRarusVRP)
	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение оптимизации'; en = 'Performing optimization'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ПараметрыПроцедуры = Новый Структура("АдресХранилищаДО,IDЗадачиВнешнийМаршрутизатор,флRarusVRP,ТипМаршрутизации",
	АдресХранилищаДО, IDЗадачиВнешнийМаршрутизатор, флRarusVRP, "SVRP");

	Возврат ДлительныеОперации.ВыполнитьВФоне(
	"уатВнешнийМаршрутизаторСервер_уэ.Маршрутизация_ПроверитьВыполнениеЗадания",
	ПараметрыПроцедуры,
	ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти

#КонецОбласти
